In [2]:
import pandas as pd
import sqlite3

In [3]:
conn = sqlite3.connect('./../course_material/Data/maven.db')

In [5]:
pd.read_sql_query("SELECT * FROM courses", conn).head()
# conn.close() ## close the db connection at the end

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [11]:
df = pd.read_sql('SELECT * FROM courses where instructor like \'Alice%\'', conn).head()

In [12]:
print(df.head())

   course_id                       course  instructor
0        201    Exploratory Data Analysis  Alice Zhao
1        331  Natural Language Processing  Alice Zhao

In [9]:
df.shape

(5, 3)

In [10]:
df.head(2)

   course_id           course    instructor
0        101  Intro to Python  Chris Bruehl
1        102     Intro to SQL   John Pauler

In [15]:
df = pd.read_sql('SELECT * FROM courses', conn)

In [16]:
df.shape

(5, 3)

In [17]:
df.count()

course_id     5
course        5
instructor    5
dtype: int64

In [18]:
df.describe()

        course_id
count    5.000000
mean   207.200000
std    107.829495
min    101.000000
25%    102.000000
50%    201.000000
75%    301.000000
max    331.000000

In [19]:
df.infer_objects()

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   course_id   5 non-null      int64
 1   course      5 non-null      object
 2   instructor  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes